; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_2 object type_3 type_1)
 (:predicates (pred_2 ?v6 - type_3 ?v5 - type_2)
 	      (pred_3 ?v7 - object ?v5 - type_2)
	      (pred_4 ?v6 - type_3 ?v2 - type_1)
	      (pred_1 ?v6 - type_3 ?v7 - object ?v2 - type_1))

   (:action op_3
       :parameters  (?v6 - type_3 ?v4 ?v1 - type_2)
       :precondition (and  (pred_2 ?v6 ?v4))
       :effect (and  (pred_2 ?v6 ?v1)
		     (not (pred_2 ?v6 ?v4))))

   (:action op_1
       :parameters (?v6 - type_3 ?v3 - object ?v8 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_3 ?v3 ?v8) (pred_2 ?v6 ?v8) (pred_4 ?v6 ?v2))
       :effect (and (pred_1 ?v6 ?v3 ?v2)
		    (not (pred_3 ?v3 ?v8)) 
		    (not (pred_4 ?v6 ?v2))))

   (:action op_2
       :parameters (?v6 - type_3 ?v3 - object ?v8 - type_2 ?v2 - type_1)
       :precondition  (and  (pred_1 ?v6 ?v3 ?v2) (pred_2 ?v6 ?v8))
       :effect (and (pred_3 ?v3 ?v8)
		    (pred_4 ?v6 ?v2)
		    (not (pred_1 ?v6 ?v3 ?v2)))))

; problem
(define (problem gripper-2-4-4)
(:domain gripper-strips)
(:objects obj_05 obj_06 - type_3
obj_13 obj_04 obj_10 obj_03 - type_1
obj_07 obj_11 obj_14 obj_01 - type_2
obj_09 obj_08 obj_12 obj_02 - object)
(:init
(pred_2 obj_05 obj_01)
(pred_4 obj_05 obj_13)
(pred_4 obj_05 obj_04)
(pred_2 obj_06 obj_01)
(pred_4 obj_06 obj_10)
(pred_4 obj_06 obj_03)
(pred_3 obj_09 obj_01)
(pred_3 obj_08 obj_11)
(pred_3 obj_12 obj_01)
(pred_3 obj_02 obj_07)
)
(:goal
(and
(pred_3 obj_09 obj_11)
(pred_3 obj_08 obj_14)
(pred_3 obj_12 obj_14)
(pred_3 obj_02 obj_11)
)
)

(:constraints
  (always (not (pred_2 obj_05 obj_14)))
)
)

; plan
1. (op_1 obj_05 obj_09 obj_01 obj_13)
   deleted: (pred_3 obj_09 obj_01) (pred_4 obj_05 obj_13)
   added: (pred_1 obj_05 obj_09 obj_13)
   goals met: 0 of 4
2. (op_1 obj_06 obj_12 obj_01 obj_03)
   deleted: (pred_3 obj_12 obj_01) (pred_4 obj_06 obj_03)
   added: (pred_1 obj_06 obj_12 obj_03)
   goals met: 0 of 4
3. (op_3 obj_05 obj_01 obj_11)
   deleted: (pred_2 obj_05 obj_01)
   added: (pred_2 obj_05 obj_11)
   goals met: 0 of 4
4. (op_3 obj_06 obj_01 obj_14)
   deleted: (pred_2 obj_06 obj_01)
   added: (pred_2 obj_06 obj_14)
   goals met: 0 of 4
5. (op_2 obj_06 obj_12 obj_14 obj_03)
   deleted: (pred_1 obj_06 obj_12 obj_03)
   added: (pred_3 obj_12 obj_14) (pred_4 obj_06 obj_03)
   goals met: 1 of 4
6. (op_2 obj_05 obj_09 obj_11 obj_13)
   deleted: (pred_1 obj_05 obj_09 obj_13)
   added: (pred_3 obj_09 obj_11) (pred_4 obj_05 obj_13)
   goals met: 2 of 4
7. (op_1 obj_05 obj_08 obj_11 obj_04)
   deleted: (pred_3 obj_08 obj_11) (pred_4 obj_05 obj_04)
   added: (pred_1 obj_05 obj_08 obj_04)
   goals met: 2 of 4
8. (op_3 obj_06 obj_14 obj_07)
   deleted: (pred_2 obj_06 obj_14)
   added: (pred_2 obj_06 obj_07)
   goals met: 2 of 4
9. (op_2 obj_05 obj_08 obj_11 obj_04)
   deleted: (pred_1 obj_05 obj_08 obj_04)
   added: (pred_3 obj_08 obj_11) (pred_4 obj_05 obj_04)
   goals met: 2 of 4
10. (op_1 obj_06 obj_02 obj_07 obj_03)
   deleted: (pred_3 obj_02 obj_07) (pred_4 obj_06 obj_03)
   added: (pred_1 obj_06 obj_02 obj_03)
   goals met: 2 of 4
11. (op_3 obj_06 obj_07 obj_11)
   deleted: (pred_2 obj_06 obj_07)
   added: (pred_2 obj_06 obj_11)
   goals met: 2 of 4
12. (op_2 obj_06 obj_02 obj_11 obj_03)
   deleted: (pred_1 obj_06 obj_02 obj_03)
   added: (pred_3 obj_02 obj_11) (pred_4 obj_06 obj_03)
   goals met: 3 of 4
13. (op_1 obj_06 obj_08 obj_11 obj_03)
   deleted: (pred_3 obj_08 obj_11) (pred_4 obj_06 obj_03)
   added: (pred_1 obj_06 obj_08 obj_03)
   goals met: 3 of 4
14. (op_3 obj_06 obj_11 obj_14)
   deleted: (pred_2 obj_06 obj_11)
   added: (pred_2 obj_06 obj_14)
   goals met: 3 of 4
15. (op_2 obj_06 obj_08 obj_14 obj_03)
   deleted: (pred_1 obj_06 obj_08 obj_03)
   added: (pred_3 obj_08 obj_14) (pred_4 obj_06 obj_03)
   goals met: 4 of 4
